<template>
	<div class="paddingTop45 agreement">
		<register-header :datas="headerData"></register-header>
		<div class="agreement-text">
			<div class="agreement-text-box">
				<div class="agreement-text-box-hearder">
					《黄金商城服务协议》
				</div>
				<div class="div">
					本协议是您与盛世金选商城（简称"本站"，网址：https://maijinmall.com；https://m.maijinmall.com）所有者深圳市盛世金选电子商务有限公司（以下简称为"盛世金选"）之间就本站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您勾选"同意"按钮后，本协议即构成对双方有约束力的法律文件。
				</div>
				<div class="div">
					第1条 本站服务条款的确认和接纳
				</div>
				<div class="div">
				1.1本站的各项电子服务的所有权和运作权归盛世金选所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。
				</div>
				<div class="div">
				1.2用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。
				</div>
				<div class="div">
				1.3盛世金选保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。
				</div>
				<div class="div">
				第2条 本站服务
				</div>
				<div class="div">
				2.1盛世金选通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。
				</div>
				<div class="div">
				2.2用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。
				</div>
				<div class="div">
					<div>
						第3条 用户信息及隐私权保护
					</div>
				    <div>
				    	3.1用户信息的提供、搜集及核实。
				    </div>
				</div>
				<div class="div">
				（1）您有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性、安全性和及时更新，以便本站为您提供服务并与您进行及时、有效的联系。您应完全独自承担因通过该等联系方式无法与您取得联系而导致的您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。倘若您提供的资料不真实、准确和完整或我公司有合理理由怀疑该资料不真实、准确、完整的，我公司有权暂停或终止您的注册身份, 并拒绝您在目前和将来对服务以任何形式使用。如因您所提供的资料的不真实、不准确、不完整或不能反映当前情况而给我公司或其他关联公司造成损失的，您应承担相应的赔偿责任。
				</div>
				<div class="div">
				（2）您知悉，本站可能自公开及其他合法资料来源收集您的其他信息，以更好地了解本站用户，并为其度身订造本站服务、解决争议和确保在网站进行交易的安全性。本站仅收集本站认为就此目的及达成该目的所必须的关于您的个人资料。
				</div>
				<div class="div">
				（3）您同意本站可以自行或通过合作的第三方机构对您提交或本站搜集的用户信息（包括但不限于您的个人身份证信息等）进行核实，并对获得的核实结果根据本协议及有关文件进行查看、使用和留存等操作。
				</div>
				<div class="div">
				（4）本站按照您在本站上的行为自动追踪关于您的某些资料。本站利用这些资料进行有关本站之用户的人口统计、兴趣及行为的内部研究，以更好地了解您以便向您和本站的其他用户提供更好的服务。
				</div>
				<div class="div">
				（5）本站在本站的某些网页上使用诸如“Cookies”的资料收集装置。“Cookies”是设置在您的硬盘上的小档案，以协助本站为您提供度身订造的服务。本站亦提供某些只能通过使用“Cookies”才可得到的功能。本站还利用“Cookies”使您能够在某段期间内减少输入密码的次数。“Cookies”还可以协助本站提供专门针对您的兴趣而提供的资料。
				</div>
				<div class="div">
				（6）如果您将个人通讯信息（例如：手机短信、电邮或信件）交付给本站，或如果其他用户或第三方向本站发出关于您在本网站上的活动或登录事项的通讯信息，本站可以将这些资料收集在您的专门档案中。
				</div>
				<div class="div">
				3.2用户信息的使用和披露。
				</div>
				<div class="div">
				（1）您同意本站可使用关于您的个人资料（包括但不限于本网站持有的有关您的档案中的资料，及本站从您目前及以前在本站上的活动所获取的其他资料）以解决争议、对纠纷进行调停、确保在本站进行安全交易以及其他合法用途，并执行本站的服务协议及相关规则。本站有时可能调查多个用户以识别问题或解决争议，特别是本站可审查您的资料以区分使用多个用户名或别名的用户。为限制在网站上的欺诈或其他非法行为、刑事犯罪活动，避免对本站及注册用户造成损失，您同意本站可通过人工或自动程序对您的个人资料进行评价并根据实际需要在本站的相关板块予以显示。
				</div>
				<div class="div">
			         （2）您同意本站可以使用您的个人资料以改进本站的推广和促销工作、分析网站的使用率、改善本站的内容和产品推广形式，并使本站的网站内容、设计和服务更能符合用户的要求。
				</div>
				<div class="div">
				（3）您同意本站利用您的资料与您联络并（在某些情况下）向您传递针对您的兴趣而提供的信息，该等信息包括但不限于：有针对性的广告条、行政管理方面的通知、产品提供以及有关您使用本站的通讯。您接受本协议即视为您同意收取这些资料。
				</div>
				<div class="div">
				（4）您注册成功后应妥善保管您的用户名和密码，如果因您未保管好自己的账户和密码而对您自身、本站或第三方造成的损害，您应承担因此造成的全部损失。同时您确认，无论是您还是您的代理人，用您的用户名和密码登录本站后在本站的一切行为均代表您并由您承担相应的法律后果。
				</div>
				<div class="div">
				（5）本站对于您提供的、自行收集到的、经认证的个人信息将按照本协议及有关规则予以保护、使用或者披露。本站将采用行业标准惯例以保护您的个人资料，但鉴于技术限制，本网站不能确保您的全部私人通讯及其他个人资料不被相关方以其他方式获取。
				</div>
				<div class="div">
				（6）您使用本站服务进行交易时，您即授权本公司将您的包括但不限于真实姓名、联系方式等必要的个人信息和交易信息披露给与您交易的另一方或本站的合作机构（仅限于本站为完成拟向您提供的服务而合作的机构）。
				</div>
				<div class="div">
				（7）本站有义务根据有关法律要求向司法机关和政府部门提供您的个人资料。
				</div>
				<div class="div">
				3.3在本站提供的交易活动中，您无权要求本站提供其他用户的个人资料。
				</div>
				<div class="div">
				<div>
					第4条 用户依法言行义务
				</div>
				<div>
					本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：
				</div>
				</div>
				<div class="div">
				（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；
				</div>
				<div class="div">
				（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；
				</div>
			</div>
		</div>
	</div>
	
</template>

<script>
		import RegisterHeader from '@/components/header/header2'
		export default {
		components: {
			
			RegisterHeader
		},
		data() {
			return {
				headerData: {
					title: "注册协议",
					jumpHref: "register",
					classStyle: "",
					rightjumpHref:"my",
					icon: "static/common/my2.png",
				    classStyleFont: "color:#333333",
					classStyleIcon: "fill:#999999",
				},
			}
		}
	}
</script>

<style lang="scss" scoped>
.agreement{
	width: 100%;
	.agreement-text{
		width: 100%;
		.agreement-text-box{
			width: 92%;
			margin: 0 auto;
			.agreement-text-box-hearder{
				text-align: center;
				padding: 1rem 0rem;
				font-size: 1.1em;
			}
			.div{
				margin-bottom: 1rem;
			}
			
		}
	}
}
</style>